"""
两个界面怎么解决
"""
def fun():
    while True:
        print("=========== 界面2 =============")
        print("***          查单词           ***")
        print("***          历史记录         ***")
        print("***          注销             ***")
        print("=================================")

        cmd = input("请输入命令:")
        if cmd == "注销":
            break  # 退出二级界面

while True:
    print("=========== 界面1 =============")
    print("***          登录           ***")
    print("***          注册         ***")
    print("***          退出          ***")
    print("=================================")

    cmd = input("请输入命令:")
    if cmd == "登录":
        print("登录成功")

    elif cmd == "注册":
        fun()
